Terraform Plan Output:
```
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.data.aws_caller_identity.current: Reading...
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_kms_key.custom_s3_kms_key[0]: Refreshing state... [id=ca24a91e-2c22-4334-b872-2ae6fd3ee67c]
module.appcd_b71fd16c-797e-5a95-8e1b-ab22f1e34f43.aws_iam_role.this: Refreshing state... [id=hello-kitty-role-demo-55]
module.appcd_86ec452a-770a-59bf-87dd-67ed883e25e5.aws_cloudwatch_log_group.this: Refreshing state... [id=/aws/lambda/hello-kitty-function-demo-55]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket.this: Refreshing state... [id=hello-kitty-bucket-55]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.data.aws_caller_identity.current: Read complete after 0s [id=222634395437]
module.appcd_c1905cd6-803f-4694-874f-19d8aa3be9a6.aws_iam_role_policy.this: Refreshing state... [id=hello-kitty-role-demo-55:Writer]
module.appcd_00a20b0a-2ec0-5bdc-a08d-65a85dc81d5b.aws_lambda_function.this: Refreshing state... [id=hello-kitty-function-demo-55]
module.appcd_00a20b0a-2ec0-5bdc-a08d-65a85dc81d5b.aws_lambda_function_url.this[0]: Refreshing state... [id=hello-kitty-function-demo-55]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_kms_alias.a[0]: Refreshing state... [id=alias/s3-hello-kitty-bucket-55]
module.appcd_093364a4-9a87-4364-8723-cf8a859f49d6.aws_iam_role_policy.this: Refreshing state... [id=hello-kitty-role-demo-55:aws_s3-hello-kitty-policy]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket_versioning.this[0]: Refreshing state... [id=hello-kitty-bucket-55]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket_public_access_block.this: Refreshing state... [id=hello-kitty-bucket-55]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket_server_side_encryption_configuration.this[0]: Refreshing state... [id=hello-kitty-bucket-55]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.appcd_00a20b0a-2ec0-5bdc-a08d-65a85dc81d5b.aws_lambda_function.this must be replaced
-/+ resource "aws_lambda_function" "this" {
      ~ arn                            = "arn:aws:lambda:us-west-2:222634395437:function:hello-kitty-function-demo-55" -> (known after apply)
      ~ code_sha256                    = "ThpXeTZobED3ATPn7m4pXZIgyOEqiZM/qo5OX/My6zE=" -> (known after apply)
      ~ function_name                  = "hello-kitty-function-demo-55" -> "hello-kitty-function-infinity" # forces replacement
      ~ id                             = "hello-kitty-function-demo-55" -> (known after apply)
      ~ invoke_arn                     = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:222634395437:function:hello-kitty-function-demo-55/invocations" -> (known after apply)
      ~ last_modified                  = "2024-09-28T09:54:08.705+0000" -> (known after apply)
      - layers                         = [] -> null
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:222634395437:function:hello-kitty-function-demo-55:$LATEST" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:222634395437:function:hello-kitty-function-demo-55:$LATEST/invocations" -> (known after apply)
      ~ role                           = "arn:aws:iam::222634395437:role/hello-kitty-role-demo-55" -> (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      ~ source_code_size               = 2168 -> (known after apply)
        tags                           = {
            "appstack"  = "hello-kitty-demo"
            "component" = "hello-kitty"
        }
      ~ version                        = "$LATEST" -> (known after apply)
        # (16 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "IMAGES_BUCKET" = "hello-kitty-bucket" -> "hello-kitty-bucket-infinity"
            }
        }

      ~ ephemeral_storage (known after apply)
      - ephemeral_storage {
          - size = 512 -> null
        }

      ~ logging_config (known after apply)
      - logging_config {
          - log_format            = "Text" -> null
          - log_group             = "/aws/lambda/hello-kitty-function-demo-55" -> null
            # (2 unchanged attributes hidden)
        }

      ~ tracing_config (known after apply)
      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # module.appcd_00a20b0a-2ec0-5bdc-a08d-65a85dc81d5b.aws_lambda_function_url.this[0] must be replaced
-/+ resource "aws_lambda_function_url" "this" {
      ~ function_arn       = "arn:aws:lambda:us-west-2:222634395437:function:hello-kitty-function-demo-55" -> (known after apply)
      ~ function_name      = "hello-kitty-function-demo-55" -> "hello-kitty-function-infinity" # forces replacement
      ~ function_url       = "https://grknfrywfiaa6qedaohdlbidj40sudsi.lambda-url.us-west-2.on.aws/" -> (known after apply)
      ~ id                 = "hello-kitty-function-demo-55" -> (known after apply)
      ~ url_id             = "grknfrywfiaa6qedaohdlbidj40sudsi" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.appcd_093364a4-9a87-4364-8723-cf8a859f49d6.aws_iam_role_policy.this must be replaced
-/+ resource "aws_iam_role_policy" "this" {
      ~ id          = "hello-kitty-role-demo-55:aws_s3-hello-kitty-policy" -> (known after apply)
        name        = "aws_s3-hello-kitty-policy"
      + name_prefix = (known after apply)
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "kms:Decrypt",
                          - "kms:Encrypt",
                          - "kms:GenerateDataKey",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:kms:us-west-2:222634395437:key/ca24a91e-2c22-4334-b872-2ae6fd3ee67c",
                        ]
                      - Sid      = "AllowKmsAccess"
                    },
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:ListBucket",
                          - "s3:GetObject",
                          - "s3:GetObjectVersion",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::hello-kitty-bucket-55",
                          - "arn:aws:s3:::hello-kitty-bucket-55/*",
                        ]
                      - Sid      = "hellokittyIMAGESBUCKETS3Bucket551e1d2b88ec540687cfc51521bbe894"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ role        = "hello-kitty-role-demo-55" -> "hello-kitty-role-infinity" # forces replacement
    }

  # module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_kms_alias.a[0] must be replaced
-/+ resource "aws_kms_alias" "a" {
      ~ arn            = "arn:aws:kms:us-west-2:222634395437:alias/s3-hello-kitty-bucket-55" -> (known after apply)
      ~ id             = "alias/s3-hello-kitty-bucket-55" -> (known after apply)
      ~ name           = "alias/s3-hello-kitty-bucket-55" -> "alias/s3-hello-kitty-bucket-infinity" # forces replacement
      + name_prefix    = (known after apply)
      ~ target_key_arn = "arn:aws:kms:us-west-2:222634395437:key/ca24a91e-2c22-4334-b872-2ae6fd3ee67c" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket.this must be replaced
-/+ resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::hello-kitty-bucket-55" -> (known after apply)
      ~ bucket                      = "hello-kitty-bucket-55" -> "hello-kitty-bucket-infinity" # forces replacement
      ~ bucket_domain_name          = "hello-kitty-bucket-55.s3.amazonaws.com" -> (known after apply)
      + bucket_prefix               = (known after apply)
      ~ bucket_regional_domain_name = "hello-kitty-bucket-55.s3.us-west-2.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z3BJ6K6RIION7M" -> (known after apply)
      ~ id                          = "hello-kitty-bucket-55" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      + policy                      = (known after apply)
      ~ region                      = "us-west-2" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
        tags                        = {
            "appstack"  = "hello-kitty-demo"
            "component" = "hello-kitty"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (2 unchanged attributes hidden)

      ~ cors_rule (known after apply)

      ~ grant (known after apply)
      - grant {
          - id          = "142ffdd1f87132a598f0ca276babbb31f1f8672261731ae3635f0b84be07a341" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
            # (1 unchanged attribute hidden)
        }

      ~ lifecycle_rule (known after apply)

      ~ logging (known after apply)

      ~ object_lock_configuration (known after apply)

      ~ replication_configuration (known after apply)

      ~ server_side_encryption_configuration (known after apply)
      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - kms_master_key_id = "ca24a91e-2c22-4334-b872-2ae6fd3ee67c" -> null
                  - sse_algorithm     = "aws:kms" -> null
                }
            }
        }

      ~ versioning (known after apply)
      - versioning {
          - enabled    = true -> null
          - mfa_delete = false -> null
        }

      ~ website (known after apply)
    }

  # module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket_public_access_block.this must be replaced
-/+ resource "aws_s3_bucket_public_access_block" "this" {
      ~ bucket                  = "hello-kitty-bucket-55" -> (known after apply) # forces replacement
      ~ id                      = "hello-kitty-bucket-55" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket_server_side_encryption_configuration.this[0] must be replaced
-/+ resource "aws_s3_bucket_server_side_encryption_configuration" "this" {
      ~ bucket                = "hello-kitty-bucket-55" -> (known after apply) # forces replacement
      ~ id                    = "hello-kitty-bucket-55" -> (known after apply)
        # (1 unchanged attribute hidden)

      - rule {
          - bucket_key_enabled = false -> null

          - apply_server_side_encryption_by_default {
              - kms_master_key_id = "ca24a91e-2c22-4334-b872-2ae6fd3ee67c" -> null
              - sse_algorithm     = "aws:kms" -> null
            }
        }
      + rule {
          + apply_server_side_encryption_by_default {
              + kms_master_key_id = "ca24a91e-2c22-4334-b872-2ae6fd3ee67c"
              + sse_algorithm     = "aws:kms"
            }
        }
    }

  # module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket_versioning.this[0] must be replaced
-/+ resource "aws_s3_bucket_versioning" "this" {
      ~ bucket                = "hello-kitty-bucket-55" -> (known after apply) # forces replacement
      ~ id                    = "hello-kitty-bucket-55" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ versioning_configuration {
          + mfa_delete = (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # module.appcd_86ec452a-770a-59bf-87dd-67ed883e25e5.aws_cloudwatch_log_group.this must be replaced
-/+ resource "aws_cloudwatch_log_group" "this" {
      ~ arn               = "arn:aws:logs:us-west-2:222634395437:log-group:/aws/lambda/hello-kitty-function-demo-55" -> (known after apply)
      ~ id                = "/aws/lambda/hello-kitty-function-demo-55" -> (known after apply)
      ~ log_group_class   = "STANDARD" -> (known after apply)
      ~ name              = "/aws/lambda/hello-kitty-function-demo-55" -> "/aws/lambda/hello-kitty-function-infinity" # forces replacement
      + name_prefix       = (known after apply)
        tags              = {
            "appstack"  = "hello-kitty-demo"
            "component" = "hello-kitty"
        }
        # (4 unchanged attributes hidden)
    }

  # module.appcd_b71fd16c-797e-5a95-8e1b-ab22f1e34f43.aws_iam_role.this must be replaced
-/+ resource "aws_iam_role" "this" {
      ~ arn                   = "arn:aws:iam::222634395437:role/hello-kitty-role-demo-55" -> (known after apply)
      ~ create_date           = "2024-09-28T09:53:59Z" -> (known after apply)
      ~ id                    = "hello-kitty-role-demo-55" -> (known after apply)
      ~ managed_policy_arns   = [] -> (known after apply)
      ~ name                  = "hello-kitty-role-demo-55" -> "hello-kitty-role-infinity" # forces replacement
      + name_prefix           = (known after apply)
        tags                  = {
            "appstack"  = "hello-kitty-demo"
            "component" = "hello-kitty"
        }
      ~ unique_id             = "AROATHVQLI4W4O72L2G4C" -> (known after apply)
        # (7 unchanged attributes hidden)

      ~ inline_policy (known after apply)
      - inline_policy {
          - name   = "Writer" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "logs:CreateLogGroup",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:logs:us-west-2:222634395437:log-group:/aws/lambda/hello-kitty-function-demo-55",
                            ]
                          - Sid      = "CloudWatchLogGroup86ec452a770a59bf87dd67ed883e25e50"
                        },
                      - {
                          - Action   = [
                              - "logs:CreateLogStream",
                              - "logs:PutLogEvents",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:logs:us-west-2:222634395437:log-group:/aws/lambda/hello-kitty-function-demo-55:*",
                            ]
                          - Sid      = "CloudWatchLogGroup86ec452a770a59bf87dd67ed883e25e51"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
      - inline_policy {
          - name   = "aws_s3-hello-kitty-policy" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "kms:Decrypt",
                              - "kms:Encrypt",
                              - "kms:GenerateDataKey",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:kms:us-west-2:222634395437:key/ca24a91e-2c22-4334-b872-2ae6fd3ee67c",
                            ]
                          - Sid      = "AllowKmsAccess"
                        },
                      - {
                          - Action   = [
                              - "s3:PutObject",
                              - "s3:ListBucket",
                              - "s3:GetObject",
                              - "s3:GetObjectVersion",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:s3:::hello-kitty-bucket-55",
                              - "arn:aws:s3:::hello-kitty-bucket-55/*",
                            ]
                          - Sid      = "hellokittyIMAGESBUCKETS3Bucket551e1d2b88ec540687cfc51521bbe894"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # module.appcd_c1905cd6-803f-4694-874f-19d8aa3be9a6.aws_iam_role_policy.this must be replaced
-/+ resource "aws_iam_role_policy" "this" {
      ~ id          = "hello-kitty-role-demo-55:Writer" -> (known after apply)
        name        = "Writer"
      + name_prefix = (known after apply)
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:us-west-2:222634395437:log-group:/aws/lambda/hello-kitty-function-demo-55",
                        ]
                      - Sid      = "CloudWatchLogGroup86ec452a770a59bf87dd67ed883e25e50"
                    },
                  - {
                      - Action   = [
                          - "logs:CreateLogStream",
                          - "logs:PutLogEvents",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:us-west-2:222634395437:log-group:/aws/lambda/hello-kitty-function-demo-55:*",
                        ]
                      - Sid      = "CloudWatchLogGroup86ec452a770a59bf87dd67ed883e25e51"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ role        = "hello-kitty-role-demo-55" -> "hello-kitty-role-infinity" # forces replacement
    }

Plan: 11 to add, 0 to change, 11 to destroy.

Changes to Outputs:
  - aws_cloudwatch_log_group_aws_lambda_hello_kitty_function_demo_55_arn   = "arn:aws:logs:us-west-2:222634395437:log-group:/aws/lambda/hello-kitty-function-demo-55" -> null
  - aws_cloudwatch_log_group_aws_lambda_hello_kitty_function_demo_55_name  = "/aws/lambda/hello-kitty-function-demo-55" -> null
  + aws_cloudwatch_log_group_aws_lambda_hello_kitty_function_infinity_arn  = (known after apply)
  + aws_cloudwatch_log_group_aws_lambda_hello_kitty_function_infinity_name = "/aws/lambda/hello-kitty-function-infinity"
  - aws_iam_role_hello_kitty_role_demo_55_arn                              = "arn:aws:iam::222634395437:role/hello-kitty-role-demo-55" -> null
  - aws_iam_role_hello_kitty_role_demo_55_name                             = "hello-kitty-role-demo-55" -> null
  + aws_iam_role_hello_kitty_role_infinity_arn                             = (known after apply)
  + aws_iam_role_hello_kitty_role_infinity_name                            = "hello-kitty-role-infinity"
  - aws_lambda_hello_kitty_function_demo_55_function_arn                   = "arn:aws:lambda:us-west-2:222634395437:function:hello-kitty-function-demo-55" -> null
  - aws_lambda_hello_kitty_function_demo_55_function_name                  = "hello-kitty-function-demo-55" -> null
  - aws_lambda_hello_kitty_function_demo_55_function_url                   = "https://grknfrywfiaa6qedaohdlbidj40sudsi.lambda-url.us-west-2.on.aws/" -> null
  - aws_lambda_hello_kitty_function_demo_55_invoke_arn                     = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:222634395437:function:hello-kitty-function-demo-55/invocations" -> null
  + aws_lambda_hello_kitty_function_infinity_function_arn                  = (known after apply)
  + aws_lambda_hello_kitty_function_infinity_function_name                 = "hello-kitty-function-infinity"
  + aws_lambda_hello_kitty_function_infinity_function_url                  = (known after apply)
  + aws_lambda_hello_kitty_function_infinity_invoke_arn                    = (known after apply)
  - aws_s3_hello_kitty_bucket_55_arn                                       = "arn:aws:s3:::hello-kitty-bucket-55" -> null
  - aws_s3_hello_kitty_bucket_55_bucket_name                               = "hello-kitty-bucket-55" -> null
  - aws_s3_hello_kitty_bucket_55_kms_arn                                   = "arn:aws:kms:us-west-2:222634395437:key/ca24a91e-2c22-4334-b872-2ae6fd3ee67c" -> null
  + aws_s3_hello_kitty_bucket_infinity_arn                                 = (known after apply)
  + aws_s3_hello_kitty_bucket_infinity_bucket_name                         = (known after apply)
  + aws_s3_hello_kitty_bucket_infinity_kms_arn                             = "arn:aws:kms:us-west-2:222634395437:key/ca24a91e-2c22-4334-b872-2ae6fd3ee67c"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```